; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v3 ?v1)
             (pred_6 ?v6 ?v11)
             (pred_5 ?v3 ?v11)
             (pred_4 ?v5 ?v3 )
	     (pred_11 ?v3)
             (pred_8 ?v7)
             (pred_12 ?v6)
             (pred_9 ?v11)
             (pred_3 ?v3)
             (pred_7 ?v6)
             (pred_10 ?v3)
             (pred_2 ))



(:action op_4
:parameters (?v10 ?v12 ?v4 ?v9)
:precondition (and (pred_8 ?v10) (pred_8 ?v12) (pred_12 ?v4) (pred_9 ?v9)
          (pred_1 ?v10 ?v12) (pred_6 ?v4 ?v9)
                   (pred_5 ?v12 ?v9) (pred_11 ?v10) 
                   (pred_3 ?v12) (pred_7 ?v4))
:effect (and  (pred_10 ?v12) (not (pred_3 ?v12))))


(:action op_5
:parameters (?v10 ?v2)
:precondition (and (pred_8 ?v10) (pred_8 ?v2)
               (pred_11 ?v10) (pred_1 ?v10 ?v2) (pred_10 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v10))))

(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_8 ?v10) (pred_12 ?v4) 
                  (pred_11 ?v10) (pred_4 ?v4 ?v10) (pred_2 ))
:effect (and (pred_7 ?v4)
   (not (pred_4 ?v4 ?v10)) (not (pred_2 ))))


(:action op_3
:parameters (?v10 ?v13 ?v8)
:precondition (and (pred_8 ?v10) (pred_12 ?v13) (pred_12 ?v8)
                  (pred_11 ?v10) (pred_7 ?v8) (pred_4 ?v13 ?v10))
:effect (and (pred_7 ?v13) (pred_4 ?v8 ?v10)
        (not (pred_7 ?v8)) (not (pred_4 ?v13 ?v10))))

(:action op_2
:parameters (?v10 ?v4)
:precondition (and (pred_8 ?v10) (pred_12 ?v4) 
                  (pred_11 ?v10) (pred_7 ?v4))
:effect (and (pred_2 ) (pred_4 ?v4 ?v10) (not (pred_7 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_07 obj_09 obj_06 obj_11 obj_03 obj_08 obj_13
    obj_10 obj_02
    obj_05 obj_04
    )

    (:init
       (pred_2)

       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_13)
       (pred_9 obj_10)
       (pred_9 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_04)

       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_08)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_5  obj_09 obj_10)
       (pred_5  obj_12 obj_02)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_13)

       (pred_6  obj_05 obj_10)
       (pred_6  obj_04 obj_02)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_04 obj_06)
       (pred_11 obj_07)
    )

    (:goal (and
       (pred_4 obj_05 obj_13)
       (pred_4 obj_04 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_11)))
)
)

; plan
1. (op_1 obj_07 obj_05)
   deleted: (pred_4 obj_05 obj_07) (pred_2)
   added: (pred_7 obj_05)
   goals met: 0 of 2
2. (op_5 obj_07 obj_01)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_01)
   goals met: 0 of 2
3. (op_5 obj_01 obj_06)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_06)
   goals met: 0 of 2
4. (op_3 obj_06 obj_04 obj_05)
   deleted: (pred_7 obj_05) (pred_4 obj_04 obj_06)
   added: (pred_7 obj_04) (pred_4 obj_05 obj_06)
   goals met: 0 of 2
5. (op_5 obj_06 obj_01)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_01)
   goals met: 0 of 2
6. (op_5 obj_01 obj_07)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_07)
   goals met: 0 of 2
7. (op_2 obj_07 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_2) (pred_4 obj_04 obj_07)
   goals met: 1 of 2
8. (op_5 obj_07 obj_01)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_01)
   goals met: 1 of 2
9. (op_5 obj_01 obj_06)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_06)
   goals met: 1 of 2
10. (op_1 obj_06 obj_05)
   deleted: (pred_4 obj_05 obj_06) (pred_2)
   added: (pred_7 obj_05)
   goals met: 1 of 2
11. (op_5 obj_06 obj_08)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_08)
   goals met: 1 of 2
12. (op_5 obj_08 obj_13)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_13)
   goals met: 1 of 2
13. (op_2 obj_13 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_2) (pred_4 obj_05 obj_13)
   goals met: 2 of 2
